#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.infra_output: Reading...
data.aws_iam_policy_document.assume_by_codedeploy: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_iam_policy_document.assume_by_codedeploy: Read complete after 0s [id=4250039221]
aws_iam_role.codedeploy: Refreshing state... [id=app-6-code-deploy-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
data.aws_iam_policy_document.codedeploy: Reading...
data.aws_iam_policy_document.codedeploy: Read complete after 0s [id=1211725747]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
aws_iam_role_policy.codedeploy: Refreshing state... [id=app-6-code-deploy-role:terraform-20241003165455650800000001]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_codedeploy_app.application_main will be created
  + resource "aws_codedeploy_app" "application_main" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "app-6"
      + tags_all            = {
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
    }

  # aws_codedeploy_deployment_group.application_main will be created
  + resource "aws_codedeploy_deployment_group" "application_main" {
      + app_name                    = "app-6"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "app-6-deploy-group"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = "arn:aws:iam::743794601996:role/app-6-code-deploy-role"
      + tags_all                    = {
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 1
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = (sensitive value)
          + service_name = "app-6"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (sensitive value)
                }
              + target_group {
                  + name = (sensitive value)
                }
              + target_group {
                  + name = (sensitive value)
                }
            }
        }
    }

  # aws_ecs_service.service must be replaced
-/+ resource "aws_ecs_service" "service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6" -> (known after apply)
        name                               = "app-6"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ task_definition                    = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:29" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (11 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      ~ deployment_controller {
          ~ type = "ECS" -> "CODE_DEPLOY" # forces replacement
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:29" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 29 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*